In [ ]:
#importing_data_from_csv

In [2]:
import pandas as pd 
df= pd.read_csv('stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [ ]:
#show specific rows of datas from loaded data

In [8]:
import pandas as pd 
df= pd.read_csv('stock_data.csv', nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [ ]:
#change the not avalable values in same class by NaN

In [11]:
import pandas as pd 
df= pd.read_csv('stock_data.csv', na_values=['not available', 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [ ]:
#eps can be negative but revenue can't!! So to put NaN in one column we should approach in dictionary approach

In [3]:
import pandas as pd 
df= pd.read_csv('stock_data.csv', na_values={
    'eps': ['not available','n.a.'],
    'revenue': ['not available','n.a.', -1],
    'price': ['not available','n.a.'],
    'people': ['not available','n.a.']
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [ ]:
#writing back to csv file!! new file e index na chaile index= false likhte hoy

In [7]:
df.to_csv('new.csv', index= False)

In [ ]:
# only iccha moto koita column new csv file e include korte chaile

In [8]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [10]:
df.to_csv('new.csv', columns= ['tickers', 'eps','revenue'], index= False)

In [ ]:
# jodi columns er header skip korte chai

In [11]:
df.to_csv('new.csv', columns= ['tickers', 'eps','revenue'], index= False, header= False)

In [ ]:
# reading excel files

In [15]:
import pandas as pd 
df= pd.read_excel('stock_data.xlsx','Sheet1')
df

  tickers            eps   revenue price         people
0   Googl           27.82       87   845     larry page
1     WMT            4.61      484    65           n.a.
2    MSFT              -1       85    64     Bill gates
3     RIL  not available        50  1023  Mukesh Ambani
4    Tata             5.6       -1  n.a.     ratan tata

In [ ]:
# if we want to change n.a. in any column!! let's change in people column by creating function

In [26]:
import pandas as pd 
def convert_people_cell (cell):
    if cell == 'n.a.':
        return'sam walton'
    return cell
def convert_eps_cell (cell):
    if cell == "not available":
        return None
    return cell
df= pd.read_excel('stock_data.xlsx','Sheet1', converters ={
    'people': convert_people_cell, 
    'eps': convert_eps_cell
})
df

  tickers            eps   revenue price         people
0   Googl           27.82       87   845     larry page
1     WMT            4.61      484    65     sam walton
2    MSFT              -1       85    64     Bill gates
3     RIL  not available        50  1023  Mukesh Ambani
4    Tata             5.6       -1  n.a.     ratan tata

In [ ]:
#writing excel file from the values

In [27]:
df.to_excel('New.xlsx', sheet_name='stocks')

In [ ]:
#agger moto csv te ja ja addition korte partam, omne korte parbo abar

In [ ]:
#duita alada alada dataframe same excel file e duita alada alada sheet e create korar way using dictionary

In [36]:
df_stock =pd.DataFrame({
    'tickers':['Googl','WMT','MSFT','RIL'],
    'eps':[27.82,4.61,-1,'not available'],
    'revenue': [87,484,85,50]
})
df_weather= pd.DataFrame({
    'day': ['Jan-1', 'Jan-2','Jan-3','Jan-4','Jan-5','Jan-6'],
    'temperature': [32,35,28,24,32,31],
    'windspeed': [6,7,2,7,4,2],
    'event': ['rain','sunny','snow', 'snow','rain','sunny']
})

In [37]:
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    df_stock.to_excel(writer, sheet_name ="Stock")
    df_weather.to_excel(writer, sheet_name="weather")